In [1]:
#convenient way to deal with missing data
import numpy as np
import pandas as pd
df = pd.DataFrame({'A':[1,2,np.nan],
                  'B':[5,np.nan,np.nan],
                  'C':[1,2,3]})

In [2]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [3]:
df.dropna()#drop row that have nan value, row wise

     A    B  C
0  1.0  5.0  1

In [4]:
df.dropna(axis=1)#drop col that have nan value

   C
0  1
1  2
2  3

In [5]:
df.dropna(thresh=2) #2 ta ba beshi item er val=nan hole drop

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [6]:
df.fillna(value='Fiil Value')#nan val ke 'Fiil Vallue' (ekhane je kono val deya jabe) diye fill up korete

            A           B  C
0         1.0         5.0  1
1         2.0  Fiil Value  2
2  Fiil Value  Fiil Value  3

In [7]:
df['A'].fillna(df['A'])

0    1.0
1    2.0
2    NaN
Name: A, dtype: float64

In [8]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [9]:
df['B'].fillna(df['A'])

0    5.0
1    2.0
2    NaN
Name: B, dtype: float64

In [10]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [11]:
df['A'].fillna(1)

0    1.0
1    2.0
2    1.0
Name: A, dtype: float64

In [12]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [13]:
df['A'].fillna(1, inplace=True)

In [14]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  1.0  NaN  3

In [15]:
#df e 'A' changed for real